/*
(i) Код попадает в итоговый файл,
только когда вызвана функция,
например flsFunctions.spollers();
Или когда импортирован весь файл,
например import "files/script.js";
Неиспользуемый (не вызванный)
код в итоговый файл не попадает.

Если мы хотим добавить модуль
следует его расскоментировать
*/

// Включить/выключить FLS (Full Logging System) (в работе)
window['FLS'] = false;

// Подключение основного файла стилей
import "../scss/style.scss";

// ========================================================================================================================================================================================================================================================
// Функционал ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
import * as flsFunctions from "./files/functions.js";

/* Проверка поддержки webp, добавление класса webp или no-webp для HTML */
/* (i) необходимо для корректного отображения webp из css  */
flsFunctions.isWebp();
/* Добавление класса touch для HTML если браузер мобильный */
flsFunctions.addTouchClass();
/* Добавление loaded для HTML после полной загрузки страницы */
flsFunctions.addLoadedClass();
/* Модуль для работы с меню (Бургер) */
flsFunctions.menuInit();
/* Учет плавающей панели на мобильных устройствах при 100vh */
flsFunctions.fullVHfix();

/*
Модуль работы со спойлерами
Документация: https://template.fls.guru/template-docs/modul-spojlery.html
Сниппет (HTML): spollers
*/
flsFunctions.spollers();

/*
Модуль работы с табами
Документация: https://template.fls.guru/template-docs/modul-taby.html
Сниппет (HTML): tabs
*/
// flsFunctions.tabs();

/*
Модуль "показать еще"
Документация: https://template.fls.guru/template-docs/modul-pokazat-eshhjo.html
Сниппет (HTML): showmore
*/
// flsFunctions.showMore();

/*
Попапы
Документация: https://template.fls.guru/template-docs/funkcional-popup.html
Сниппет (HTML): pl
*/
// import './libs/popup.js'

/*
Модуль параллакса мышью
Документация: 
Сниппет (HTML): 
*/
// import './libs/parallax-mouse.js'

// ========================================================================================================================================================================================================================================================
// Работа с формами ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
import * as flsForms from "./files/forms/forms.js";

/* Работа с полями формы */
/* Документация: https://template.fls.guru/template-docs/rabota-s-formami.html */
flsForms.formFieldsInit({ viewPass: false });

/* Oтправка формы */
/* Документация: https://template.fls.guru/template-docs/rabota-s-formami.html */
// flsForms.formSubmit();

/* Модуль формы "колличество" */
// flsForms.formQuantity();

/* Модуль звездного рейтинга */
//flsForms.formRating();

/* Модуль работы с select. */
// import './libs/select.js'

/* (В работе) Модуль работы с масками.*/
/*
Подключение и настройка выполняется в файле js/files/forms/inputmask.js
Документация по работе в шаблоне:
Документация плагина: https://github.com/RobinHerbots/inputmask
Сниппет(HTML):
*/
// import "./files/forms/inputmask.js";

/* Модуль работы с ползунком */
/*
Подключение и настройка выполняется в файле js/files/forms/range.js
Документация по работе в шаблоне:
Документация плагина: https://refreshless.com/nouislider/
Сниппет (HTML): range
*/
// import "./files/forms/range.js";

/* Модуль работы с подсказками (tippy) */
/*
Подключение плагина Tippy.js и настройка выполняется в файле js/files/tippy.js
Документация по работе в шаблоне:
Документация плагина: https://atomiks.github.io/tippyjs/
Сниппет (HTML): tip (добавляет атрибут с подсказкой для html тега)
*/
// import "./files/tippy.js";

// ========================================================================================================================================================================================================================================================
// Работа со слайдером (Swiper) ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
/*
Настройка подключения плагина слайдера Swiper и новых слайдеров выполняется в файле js/files/sliders.js
Документация по работе в шаблоне: https://template.fls.guru/template-docs/rabota-so-slajderom-swiper.html
Документация плагина: https://swiperjs.com/
Сниппет(HTML): swiper
*/
import "./files/sliders.js";

// ========================================================================================================================================================================================================================================================
// Модули работы с прокруткой страницы ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================

/*
Изменение дизайна скроллбара
Документация по работе в шаблоне: В HTML добавляем к блоку атрибут data-simplebar
Документация плагина: https://github.com/Grsmto/simplebar/tree/master/packages/simplebar
Сниппет(HTML): 
*/
// import './files/scroll/simplebar.js';

// Ленивая (отложенная) загрузка картинок
// Документация по работе в шаблоне: https://template.fls.guru/template-docs/modul-lenivaya-podgruzka-lazy-loading.html
// Документация плагина: https://github.com/verlok/vanilla-lazyload
// Сниппет(HTML):
// import './files/scroll/lazyload.js';

// Наблюдатель за объектами c атрибутом data-watch
// Документация: https://template.fls.guru/template-docs/modul-nabljudatel-za-poyavleniem-elementa-pri-skrolle.html
// Сниппет(HTML):
import './libs/watcher.js'

// Функции работы скроллом
import * as flsScroll from "./files/scroll/scroll.js";

// Плавная навигация по странице
// Документация: https://template.fls.guru/template-docs/modul-plavnoj-navigacii-po-stranice.html
flsScroll.pageNavigation();

// Функционал добавления классов к хедеру при прокрутке
// Документация: https://template.fls.guru/template-docs/modul-dobavleniya-klassov-k-shapke-pri-prokrutke-stranicy.html
flsScroll.headerScroll();

// Функционал липкого блока
// flsScroll.stickyBlock();

// ========================================================================================================================================================================================================================================================
// Галерея ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
/*
Документация по работе в шаблоне: 
Документация плагина: https://www.lightgalleryjs.com/docs/
Сниппет(HTML):
*/
// import "./files/gallery.js";

// ========================================================================================================================================================================================================================================================
// Прочие плагины ============================================================================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================

/* Динамический адаптив */
// Документация: https://template.fls.guru/template-docs/dinamicheskij-adaptiv.html
import "./libs/dynamic_adapt.js";

/* Форматирование чисел */
// import './libs/wNumb.min.js';

// ========================================================================================================================================================================================================================================================

/* Подключаем файлы со своим кодом */
import "./files/script.js";

//============================================================================================================================================================================================================================================

/* Библиотека jquery */
import './libs/jquery-3.6.0.min.js'
import "./libs/jquery.ripples.js";
/*
gsap.timeline({
	scrollTrigger: {
		trigger: ".main-block__center",
		start: "main-block__center",
		end: "circle",
		scrub: true,
		pin: true
	}
})
*/

//========================================================================================================================================================

/* Библиотека JSON */
import './libs/bodymovin.min.js'

//========================================================================================================================================================

//АНИМАЦИЯ JSON//

var animationMenu_1 = document.getElementById('animation-menu-1');
var animItem_1 = bodymovin.loadAnimation({
	wrapper: animationMenu_1,
	animType: 'svg',
	loop: true,
	path: 'https://assets1.lottiefiles.com/packages/lf20_1ag0rk7v.json'
});

var animationMenu_2 = document.getElementById('animation-menu-2');
var animItem_2 = bodymovin.loadAnimation({
	wrapper: animationMenu_2,
	animType: 'svg',
	loop: true,
	path: 'https://assets6.lottiefiles.com/packages/lf20_aaeo6wzw.json'
});

//========================================================================================================================================================

// ПЕЧАТАЮЩИЙСЯ ТЕКСТ РОБОТ 

var block_show = false;

function scrollTracking() {

	if (block_show) {
		return false;
	}

	var wt = $(window).scrollTop();
	var wh = $(window).height();
	var et = $('.animate-robot__tippy').offset().top;
	var eh = $('.animate-robot__tippy').outerHeight();
	var dh = $(document).height();

	if (wt + wh >= et || wh + wt == dh || eh + et < wh) {
		block_show = true;

		// Код анимации
		$.fn.animate_Text = function () {
			var string = this.text();
			return this.each(function () {
				var $this = $(this);
				$this.html(string.replace(/./g, '<span class="animate-robot__tippy-new">$&</span>'));
				$this.find('span.animate-robot__tippy-new').each(function (i, el) {
					setTimeout(function () {
						$(el).addClass('_active');
					}, 30 * i);
				});
			});
		};
		$('.animate-robot__tippy').show();
		$('.animate-robot__tippy').animate_Text();
	}
}

$(window).scroll(function () {
	scrollTracking();
});

//========================================================================================================================================================

//ПЕЧАТАЮЩИЙСЯ ТЕКСТ ГЛАВНОГО ЛОГО

$(function () {
	setTimeout(function () {
		$.fn.fade_img = function (ops) {
			var $elem = this;
			var res = $.extend({ delay: 400, speed: 800 }, ops);
			for (var i = 0, pause = 0, l = $elem.length; i < l; i++, pause += res.delay) {
				$elem.eq(i).delay(pause).fadeIn(res.speed)
			}
			return $elem;
		};
		$('.main-block__fade').fade_img();
	}, 2000);
})

//========================================================================================================================================================
/*
// ПРОКРУТКА К НУЖНОМУ БЛОКУ У КАТЕГОРИЙ

$(document).ready(function () {
	$('[href^="#"]').on('click', function (event) {
		if ($(this).attr('hash') !== "") {
			event.preventDefault();
			let hash = $(this).prop('hash');
			$('html, body').animate({
				scrollTop: $(hash).offset().top
			}, 800, function () {
			});
		}
	});
});
*/

//========================================================================================================================================================

//ЗВЕЗДНЫЙ РЕЙТИНГ

$(document).ready(function () {
	$('.rating__body.edit .rating__star').hover(function () {
		var block = $(this).parents('.rating');
		block.find('.rating__activeline').css({ width: '0%' });
		var ind = $(this).index() + 1;
		var linew = ind / block.find('.rating__star').length * 100;
		setrating(block, linew);
	}, function () {
		var block = $(this).parents('.rating__body');
		block.find('.rating__star').removeClass('active');
		var ind = block.find('input').val();
		var linew = ind / block.find('.rating__star').length * 100;
		setrating(block, linew);
	});
	$('.rating__body.edit .rating__star').click(function (event) {
		var block = $(this).parents('.rating__body');
		var re = $(this).index() + 1;
		block.find('input').val(re);
		var linew = re / block.find('.rating__star').length * 100;
		setrating(block, linew);
	});
	$.each($('.rating__body'), function (index, val) {
		var ind = $(this).find('input').val();
		var linew = ind / $(this).parent().find('.rating__star').length * 100;
		setrating($(this), linew);
	});
	function setrating(th, val) {
		th.find('.rating__activeline').css({ width: val + '%' });
	}
});

//========================================================================================================================================================

$(document).ready(function () {
	try {
		$('#effect-canvas').ripples({
			resolution: 350,
			perturbance: 0.01
		});
	}
	catch (e) {
		$('.error').show().text(e);
	}
});

//========================================================================================================================================================


